---
kind: method
id: M:Autodesk.Revit.DB.Architecture.ContinuousRail.GetEndExtensionPath
source: html/ddf70400-2f17-a97a-8848-13bba9650bbb.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRail.GetEndExtensionPath Method

Retrieves the start extension path.

## Syntax (C#)
```csharp
public IList<Curve> GetEndExtensionPath()
```

## Returns
The start extension path of the rail.